In [1]:
import pandas as pd
# !pip install sqlalchemy
from sqlalchemy import create_engine

In [2]:
df = pd.read_csv('NYPD_Arrest_Data__Year_to_Date_.csv')
df.columns= df.columns.str.strip().str.lower()
df.head()

,arrest_key,arrest_date,pd_cd,pd_desc,ky_cd,ofns_desc,law_code,law_cat_cd,arrest_boro,arrest_precinct,jurisdiction_code,age_group,perp_sex,perp_race,x_coord_cd,y_coord_cd,latitude,longitude,new georeferenced column
0,240143213,02/04/2022,578.0,(null),NaN,(null),PL 2223001,M,Q,107,0,25-44,M,BLACK,1035531,205745,40.731252,-73.814969,POINT (-73.814969 40.731252)
1,241527342,03/03/2022,578.0,(null),NaN,(null),PL 2223001,M,M,23,0,25-44,M,BLACK,998751,226901,40.789463,-73.947634,POINT (-73.9476340039424 40.7894632995555)
2,238849340,01/08/2022,157.0,RAPE 1,104.0,RAPE,PL 1303501,F,K,79,0,45-64,M,BLACK,999496,190300,40.689001,-73.945027,POINT (-73.9450265328727 40.68900139556)
3,239051628,01/12/2022,101.0,ASSAULT 3,344.0,ASSAULT 3 & RELATED OFFENSES,PL 1200001,M,M,13,0,45-64,M,WHITE,988971,207813,40.737074,-73.982962,POINT (-73.982962 40.737074)
4,243724341,04/15/2022,157.0,RAPE 1,104.0,RAPE,PL 1303501,F,K,67,0,45-64,M,BLACK,997843,175671,40.648851,-73.951017,POINT (-73.951016510623 40.6488507469884)

In [6]:
len(df)

76831

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 76831 entries, 0 to 76830
Data columns (total 19 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   arrest_key                76831 non-null  int64
 1   arrest_date               76831 non-null  object
 2   pd_cd                     76819 non-null  float64
 3   pd_desc                   76831 non-null  object
 4   ky_cd                     76755 non-null  float64
 5   ofns_desc                 76831 non-null  object
 6   law_code                  76831 non-null  object
 7   law_cat_cd                76120 non-null  object
 8   arrest_boro               76831 non-null  object
 9   arrest_precinct           76831 non-null  int64
 10  jurisdiction_code         76831 non-null  int64
 11  age_group                 76831 non-null  object
 12  perp_sex                  76831 non-null  object
 13  perp_race                 76831 non-null  object
 14  x_coord_cd                76831 non-null  int64
 15  y_coord_cd                76831 non-null  int64
 16  latitude                  76831 non-null  float64
 17  longitude                 76831 non-null  float64
 18  new georeferenced column  76831 non-null  object
dtypes: float64(4), int64(5), object(10)
memory usage: 11.1+ MB

In [8]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:123@localhost/NYPD'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

stmt = """
drop table if exists public.arrest_boro;
drop table if exists public.arrest_crime;
drop table if exists public.arrest_law;
drop table if exists public.arrest_offender;
drop table if exists public.offense_law_level;
drop table if exists public.arrest_location;
drop table if exists public.arrest_precinct;
drop table if exists public.borough;
drop table if exists public.crime;
drop table if exists public.law_triggered;
drop table if exists public.offender_info;
drop table if exists public.law_offense_level;
drop table if exists public."location";
drop table if exists public.precinct;
drop table if exists public.arrest; 

CREATE TABLE arrest
(
 arrest_key  int NOT NULL,
 arrest_date date NOT NULL,
 PRIMARY KEY ( arrest_key )
);


CREATE TABLE borough
(
 boro_id     int NOT NULL,
 arrest_boro char(50) NOT NULL,
 PRIMARY KEY ( boro_id )
);



CREATE TABLE crime
(
 crime_key           int NOT NULL,
 category            varchar(50) NOT NULL,
 classification_code int NOT NULL,
 PRIMARY KEY ( crime_key )
);

CREATE TABLE law_offense_level
(
 offenselevel_id int NOT NULL,
 Level_of_offense  char(50) NOT NULL,
 PRIMARY KEY ( offenselevel_id )
);



CREATE TABLE law_triggered
(
 law_key  int NOT NULL,
 law_code VARCHAR(50) NOT NULL,
 PRIMARY KEY ( law_key )
);

CREATE TABLE location
(
 location_id  int NOT NULL,
 Latitude decimal(15,13) NOT NULL,
 Longitude decimal(15,13) NOT NULL,
 PRIMARY KEY ( location_id )
);

CREATE TABLE precinct
(
 precinct_id  int NOT NULL,
 precinct_num int NOT NULL,
 PRIMARY KEY ( precinct_id )
);

CREATE TABLE offender_info
(
 Offender_id int NOT NULL,
 sex         char(50) NOT NULL,
 race        char(50) NOT NULL,
 age_group   varchar(50) NOT NULL,
 PRIMARY KEY ( Offender_id )
);

CREATE TABLE "offense_law_level"
(
 arrest_key      int NOT NULL,
 offenselevel_id int NOT NULL,
 PRIMARY KEY ( arrest_key, offenselevel_id ),
 FOREIGN KEY (arrest_key) REFERENCES Arrest(arrest_key),
 FOREIGN KEY (offenselevel_id) REFERENCES law_offense_level(offenselevel_id)
);



CREATE TABLE arrest_boro
(
 arrest_key int NOT NULL,
 boro_id    int NOT NULL,
 PRIMARY KEY ( arrest_key, boro_id ),
 FOREIGN KEY (arrest_key) REFERENCES Arrest(arrest_key),
 FOREIGN KEY (boro_id) REFERENCES Borough(boro_id)
);


CREATE TABLE arrest_crime
(
 arrest_key int NOT NULL,
 crime_key  int NOT NULL,
 PRIMARY KEY ( arrest_key, crime_key ),
 FOREIGN KEY (arrest_key) REFERENCES Arrest(arrest_key),
 FOREIGN KEY (crime_key) REFERENCES Crime(crime_key)
);


CREATE TABLE arrest_law
(
 arrest_key int NOT NULL,
 law_key    int NOT NULL,
 PRIMARY KEY ( arrest_key, law_key ),
 FOREIGN KEY (arrest_key) REFERENCES Arrest(arrest_key),
 FOREIGN KEY (law_key) REFERENCES law_triggered(law_key)
);

CREATE TABLE arrest_location
(
 arrest_key  int NOT NULL,
 location_id int NOT NULL,
 PRIMARY KEY ( arrest_key, location_id ),
 FOREIGN KEY (arrest_key) REFERENCES Arrest(arrest_key),
 FOREIGN KEY (location_id) REFERENCES Location(location_id)
);

CREATE TABLE arrest_offender
(
 arrest_key  int NOT NULL,
 offender_id int NOT NULL,
 PRIMARY KEY ( arrest_key, offender_id ),
 FOREIGN KEY (arrest_key) REFERENCES Arrest(arrest_key),
 FOREIGN KEY (offender_id) REFERENCES Offender_info(offender_id)
);


CREATE TABLE arrest_precinct
(
 arrest_key  int NOT NULL,
 precinct_id int NOT NULL,
 PRIMARY KEY ( arrest_key, precinct_id ),
 FOREIGN KEY (arrest_key) REFERENCES arrest(arrest_key),
 FOREIGN KEY (precinct_id) REFERENCES precinct(precinct_id)
);
"""

# Execute the statement to create tables
connection.execute(stmt)
df.to_sql(name='NYPD_Arrest_load', con=engine, if_exists='replace', index=False)

In [9]:
#arrest table
df[['arrest_key', 'arrest_date']].drop_duplicates().to_sql(name='arrest', con=engine, if_exists='append', index=False)

In [11]:
# INSERT Borough
borough_df = pd.DataFrame(df.arrest_boro.unique(), columns=['arrest_boro'])

borough_df.insert(0, 'boro_id', range(1, 1 + len(borough_df)))
borough_df.to_sql(name='borough', con=engine, if_exists='append', index=False)

In [12]:
# Map boro_id
boro_id_list = [borough_df.boro_id[borough_df.arrest_boro == i].values[0] for i in df.arrest_boro]

# Add boro_id to the main dataframe
df.insert(8, 'boro_id', boro_id_list)

In [13]:
# CREATE TABLE Crime
# (
#  crime_key           int NOT NULL,
#  category            varchar(50) NOT NULL,
#  classification_code int NOT NULL,
#  PRIMARY KEY ( crime_key )
# );
# INSERT Crime
crime_df = pd.DataFrame(df[['ofns_desc', 'ky_cd']].dropna().drop_duplicates(), columns=['ofns_desc','ky_cd'])
crime_df.rename(columns = {'ofns_desc':'category', 'ky_cd':'classification_code'}, inplace = True)
crime_df.insert(0, 'crime_key', range(1, 1 + len(crime_df)))
crime_df.reset_index(drop=True, inplace=True)
crime_df.to_sql(name='crime', con=engine, if_exists='append', index=False)

In [14]:
# INSERT TABLE law_offense_level

offense_level_df = pd.DataFrame(df.law_cat_cd.dropna().unique(), columns=['level_of_offense'])

offense_level_df.insert(0, 'offenselevel_id', range(1, 1 + len(offense_level_df)))

offense_level_df.to_sql(name='law_offense_level', con=engine, if_exists='append', index=False)

In [15]:
offense_level_df

   offenselevel_id level_of_offense
0                1                M
1                2                F
2                3                I
3                4                V

In [16]:
# INSERT TABLE law_triggered

law_triggered_df = pd.DataFrame(df.law_code.dropna().unique(), columns=['law_code'])

law_triggered_df.insert(0, 'law_key', range(1, 1 + len(law_triggered_df)))

law_triggered_df.to_sql(name='law_triggered', con=engine, if_exists='append', index=False)

In [17]:
# Map law_key
law_key_list = [law_triggered_df.law_key[law_triggered_df.law_code == i].values[0] for i in df.law_code]

# Add law_key to the main dataframe
df.insert(6, 'law_key', law_key_list)

In [18]:
# INSERT TABLE Location
location_df = pd.DataFrame(df[['latitude', 'longitude']].dropna().drop_duplicates(), columns=['latitude','longitude'])
location_df.rename(columns = {'latitude':'latitude', 'longitude':'longitude'}, inplace = True)
location_df.insert(0, 'location_id', range(1, 1 + len(location_df)))
location_df.reset_index(drop=True, inplace=True)
location_df.to_sql(name='location', con=engine, if_exists='append', index=False)

In [19]:
# Map location_id
location_id_list = [location_df.location_id[location_df.latitude == i].values[0] for i in df.latitude]

# Add location_id to the main dataframe
df.insert(16, 'location_id', location_id_list)

In [20]:
# INSERT TABLE Precinct
precinct_df = pd.DataFrame(df.arrest_precinct.dropna().unique(), columns=['precinct_num'])

precinct_df.insert(0, 'precinct_id', range(1, 1 + len(precinct_df)))

precinct_df.to_sql(name='precinct', con=engine, if_exists='append', index=False)

In [21]:
# Map precinct_id
precinct_id_list = [precinct_df.precinct_id[precinct_df.precinct_num == i].values[0] for i in df.arrest_precinct]

# Add precinct_id to the main dataframe
df.insert(11, 'precinct_id', precinct_id_list)

In [18]:
# df.transpose ()

In [22]:
#CREATE TABLE Offender_info
#(
# Offender_id int NOT NULL,
# sex         char(50) NOT NULL,
# race        char(50) NOT NULL,
# age_group   varchar(50) NOT NULL,
 #PRIMARY KEY ( Offender_id )
#);

offender_df = pd.DataFrame(df[['perp_sex', 'perp_race', 'age_group']].dropna().drop_duplicates(), columns = ['perp_sex', 'perp_race', 'age_group'])
offender_df.rename(columns = {'perp_sex':'sex', 'perp_race':'race', 'age_group':'age_group'}, inplace = True)
offender_df.insert(0, 'offender_id', range(1, 1 + len(offender_df)))
offender_df

       offender_id sex                            race age_group
0                1   M                           BLACK     25-44
2                2   M                           BLACK     45-64
3                3   M                           WHITE     45-64
6                4   M                           WHITE     25-44
8                5   M                           BLACK       <18
...            ...  ..                             ...       ...
25422           65   M                         UNKNOWN       <18
36322           66   M  AMERICAN INDIAN/ALASKAN NATIVE       65+
51059           67   M                         UNKNOWN       65+
51367           68   F  AMERICAN INDIAN/ALASKAN NATIVE       65+
54818           69   F                         UNKNOWN       <18

[69 rows x 4 columns]

In [23]:
offender_df.to_sql(name='offender_info', con=engine, if_exists='append', index=False)

In [24]:
#map offender
offender_id_list = [offender_df.offender_id[offender_df.sex == i].values[0] for i in df.perp_sex]

#add to the main dataframe
df.insert(14, 'offender_id', offender_id_list)

In [25]:
df.head()

,arrest_key,arrest_date,pd_cd,pd_desc,ky_cd,ofns_desc,law_key,law_code,law_cat_cd,boro_id,...,offender_id,age_group,perp_sex,perp_race,location_id,x_coord_cd,y_coord_cd,latitude,longitude,new georeferenced column
0,240143213,02/04/2022,578.0,(null),NaN,(null),1,PL 2223001,M,1,...,1,25-44,M,BLACK,1,1035531,205745,40.731252,-73.814969,POINT (-73.814969 40.731252)
1,241527342,03/03/2022,578.0,(null),NaN,(null),1,PL 2223001,M,2,...,1,25-44,M,BLACK,2,998751,226901,40.789463,-73.947634,POINT (-73.9476340039424 40.7894632995555)
2,238849340,01/08/2022,157.0,RAPE 1,104.0,RAPE,2,PL 1303501,F,3,...,1,45-64,M,BLACK,3,999496,190300,40.689001,-73.945027,POINT (-73.9450265328727 40.68900139556)
3,239051628,01/12/2022,101.0,ASSAULT 3,344.0,ASSAULT 3 & RELATED OFFENSES,3,PL 1200001,M,2,...,1,45-64,M,WHITE,4,988971,207813,40.737074,-73.982962,POINT (-73.982962 40.737074)
4,243724341,04/15/2022,157.0,RAPE 1,104.0,RAPE,2,PL 1303501,F,3,...,1,45-64,M,BLACK,5,997843,175671,40.648851,-73.951017,POINT (-73.951016510623 40.6488507469884)

In [26]:
#CREATE TABLE Arrest_boro
arrest_boro_df = pd.DataFrame(df[['arrest_key', 'boro_id']], columns = ['arrest_key', 'boro_id'])

In [27]:
arrest_boro_df.to_sql(name='arrest_boro', con=engine, if_exists='append', index=False)

In [28]:
#CREATE TABLE Arrest_crime
sql='''
truncate table public.arrest_crime;
insert into public.arrest_crime
select distinct anl.arrest_key , c.crime_key  from "NYPD_Arrest_load" anl inner join crime c   
on c.category=anl.ofns_desc and c.classification_code =anl.ky_cd;
'''
connection.execute(sql)

In [29]:
#CREATE TABLE Arrest_law
arrest_law_df = pd.DataFrame(df[['arrest_key', 'law_key']], columns = ['arrest_key', 'law_key'])

In [30]:
arrest_law_df.to_sql(name='Arrest_law', con=engine, if_exists='append', index=False)

In [31]:
#CREATE TABLE Arrest_location
arrest_location_df = pd.DataFrame(df[['arrest_key', 'location_id']], columns = ['arrest_key', 'location_id'])

In [32]:
arrest_location_df.to_sql(name='Arrest_location', con=engine, if_exists='append', index=False)

In [33]:
#CREATE TABLE arrest_offender
arrest_offender_df = pd.DataFrame(df[['arrest_key', 'offender_id']], columns = ['arrest_key', 'offender_id'])

In [34]:
arrest_offender_df.to_sql(name='arrest_offender', con=engine, if_exists='append', index=False)

In [35]:
#CREATE TABLE Arrest_precinct
arrest_precinct_df = pd.DataFrame(df[['arrest_key', 'precinct_id']], columns = ['arrest_key', 'precinct_id'])

In [36]:
arrest_precinct_df.to_sql(name='Arrest_precinct', con=engine, if_exists='append', index=False)

In [37]:
#CREATE TABLE "offense_law_level"

sql='''
truncate table public.offense_law_level;
insert into public.offense_law_level 
select distinct anl.arrest_key,lol.offenselevel_id  from "NYPD_Arrest_load" anl inner join law_offense_level lol  
on lol.level_of_offense =anl.law_cat_cd;
'''
connection.execute(sql)

#CREATE TABLE "arrest_boro"

sql='''
truncate table public.arrest_boro;
insert into public.arrest_boro 
select distinct anl.arrest_key , b.boro_id  from "NYPD_Arrest_load" anl inner join borough b 
on b.arrest_boro = anl.arrest_boro;
'''
connection.execute(sql)

#CREATE TABLE "arrest_law"
sql='''
truncate table public.arrest_law;
insert into public.arrest_law
select distinct anl.arrest_key,lt.law_key  from "NYPD_Arrest_load" anl inner join law_triggered lt 
on lt.law_code  = anl.law_code;
'''
connection.execute(sql)

#CREATE TABLE "arrest_location"
sql='''
truncate table public.arrest_location;
insert into public.arrest_location
select distinct anl.arrest_key,l.location_id  from "NYPD_Arrest_load" anl inner join "location" l  
on l.Latitude  = anl.Latitude and l.Longitude = anl.Longitude;
'''
connection.execute(sql)

#CREATE TABLE "arrest_law"
sql='''
truncate table public.arrest_law;
insert into public.arrest_law 
select distinct anl.arrest_key,lt.law_key  from "NYPD_Arrest_load" anl inner join law_triggered lt  
on anl.law_code =lt.law_code;
'''
connection.execute(sql)

#CREATE TABLE "arrest_precinct"
sql='''
truncate table public.arrest_precinct;
insert into public.arrest_precinct 
select distinct anl.arrest_key,p.precinct_id  from "NYPD_Arrest_load" anl inner join precinct p  
on anl.arrest_precinct  =p.precinct_num;
'''
connection.execute(sql)

sql='''
drop table if exists "NYPD_Arrest_load";
'''
connection.execute(sql)

In [79]:
stmt = """ select law_code, count(a.arrest_key)crime_count
FROM law_triggered l
JOIN arrest_law al
ON l.law_key = al.law_key
JOIN arrest a
ON a.arrest_key = al.arrest_key
GROUP BY 1
ORDER BY 1,2
"""
#Execute the statement and get the results from the database
results = connection.execute(stmt).fetchall()
#Extract column names
column_names = results[0].keys()

#Store results from the database in a panda DataFrame
df2 = pd.DataFrame(results, columns=column_names)
df2.head()

     law_code  crime_count
0  ABC0064B00           37
1  ABC0065000            9
2  ABC0092000            1
3  ABC0096000            2
4  ABC0100001            2

In [84]:
stmt = """ select level_of_offense, DATE_PART('month',arrest_date)::int as month, count(a.arrest_key)crime_count
FROM law_offense_level c
JOIN "offense_law_level" ac
ON c.offenselevel_id = ac.offenselevel_id
JOIN arrest a
ON a.arrest_key = ac.arrest_key
GROUP BY 1,2
ORDER BY 1,2
"""
#Execute the statement and get the results from the database
results = connection.execute(stmt).fetchall()
#Extract column names
column_names = results[0].keys()

#Store results from the database in a panda DataFrame
df5 = pd.DataFrame(results, columns=column_names)
df5

                                     level_of_offense  month  crime_count
0   F                                             ...      1         6063
1   F                                             ...      2         6298
2   F                                             ...      3         7388
3   F                                             ...      4         7109
4   F                                             ...      5         7414
5   I                                             ...      1           23
6   I                                             ...      2           32
7   I                                             ...      3           25
8   I                                             ...      4           21
9   I                                             ...      5           29
10  M                                             ...      1         6960
11  M                                             ...      2         7570
12  M                                             ...      3         9265
13  M                                             ...      4         8735
14  M                                             ...      5         8904
15  V                                             ...      1           33
16  V                                             ...      2           42
17  V                                             ...      3           70
18  V                                             ...      4           60
19  V                                             ...      5           79